/* -----------------------------------------------------------------------------	*\
Файл Tuning.h

Материалы к курсу "Программирование на языке ассемблера"

Содержит константы, которые необходимо определить в соответствии с заданием
\* -----------------------------------------------------------------------------	*/
// Количество пикселов, которые параллельно обрабатываются разработанным ядром
#define PIXELS_IN_PARALLEL  8
// Количество строк в окрестности пиксела, используемой при вычислениях
#define KERNEL_MATRIX_HIGHT 3
// Количество столбцовв окрестности пиксела, используемой при вычислениях
#define KERNEL_MATRIX_WIDTH 3
